
#### Terraform Nonprod Plan `success`
<details><summary>Show Plan</summary>

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_app_service.gratibot_app_service will be updated in-place
  ~ resource "azurerm_app_service" "gratibot_app_service" {
      ~ app_settings                      = {
          - "BOT_USER_OAUTH_ACCESS_TOKEN" = "@Microsoft.KeyVault(SecretUri=https://gratibot-nonprod.vault.azure.net/secrets/bot-user-token/96cae5ed85dc4dfd8a3ec9a51c7ad25a)"
          - "MONGO_URL"                   = "@Microsoft.KeyVault(SecretUri=https://gratibot-nonprod.vault.azure.net/secrets/mongo-connection-string/5dd067bb7c1b4e5395cfdf5c0a32a3c5)"
          - "REACTION_EMOJI"              = ":shut_up_and_take_my_fistbump:"
          - "RECOGNIZE_EMOJI"             = ":oof:"
          - "SIGNING_SECRET"              = "@Microsoft.KeyVault(SecretUri=https://gratibot-nonprod.vault.azure.net/secrets/signing-secret/bcfe274b475e4d9bb94bbec8bccbabed)"
        } -> (known after apply)
        id                                = "/subscriptions/761bf739-12c3-43cb-bec9-d87c1d7fa459/resourceGroups/gratibot-azure-data/providers/Microsoft.Web/sites/gratibot-nonprod-service"
        name                              = "gratibot-nonprod-service"
        tags                              = {}
        # (14 unchanged attributes hidden)




      ~ site_config {
          ~ linux_fx_version            = "DOCKER|ghcr.io/liatrio/gratibot:a0bbd0b" -> "DOCKER|ghcr.io/liatrio/gratibot:54277e0"
            # (17 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # azurerm_key_vault_secret.app_token will be created
  + resource "azurerm_key_vault_secret" "app_token" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/761bf739-12c3-43cb-bec9-d87c1d7fa459/resourceGroups/gratibot-azure-data/providers/Microsoft.KeyVault/vaults/gratibot-nonprod"
      + name           = "app-token"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.signing_secret will be destroyed
  - resource "azurerm_key_vault_secret" "signing_secret" {
      - id             = "https://gratibot-nonprod.vault.azure.net/secrets/signing-secret/bcfe274b475e4d9bb94bbec8bccbabed" -> null
      - key_vault_id   = "/subscriptions/761bf739-12c3-43cb-bec9-d87c1d7fa459/resourceGroups/gratibot-azure-data/providers/Microsoft.KeyVault/vaults/gratibot-nonprod" -> null
      - name           = "signing-secret" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "bcfe274b475e4d9bb94bbec8bccbabed" -> null
      - versionless_id = "https://gratibot-nonprod.vault.azure.net/secrets/signing-secret" -> null
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>